

package main

import "log"

func main()  {

	a1 := make([]*int, 3)
	a2 := make([] int, 3)

	// 给指针切片元素赋值的时候，值都是最后一个
	for k, v := range []int{1, 2, 3} {
		log.Printf("[v的值：%v][v的地址：%p]", v, &v)
		a1[k] = &v
		a2[k] = v
	}


	for i:= range a1{
		log.Println(i)
		log.Printf("[指针切片的值为：%v]", *a1[i])
	}


	for i:= range a2{
		log.Println(i)
		log.Printf("[普通值类型切片的值为：%v]", a2[i])
	}

}

/*
   2021/07/18 16:18:36 [v的值：1][v的地址：0xc0000ac058]
   2021/07/18 16:18:36 [v的值：2][v的地址：0xc0000ac058]
   2021/07/18 16:18:36 [v的值：3][v的地址：0xc0000ac058]
   2021/07/18 16:18:36 [指针切片的值为：3]
   2021/07/18 16:18:36 [指针切片的值为：3]
   2021/07/18 16:18:36 [指针切片的值为：3]
   2021/07/18 16:18:36 [普通值类型切片的值为：1]
   2021/07/18 16:18:36 [普通值类型切片的值为：2]
   2021/07/18 16:18:36 [普通值类型切片的值为：3]

*/
