package main

import "fmt"

func main()  {

	var a uint = 60
	var b uint = 13
	var c uint = 0

	fmt.Printf("[a=%d 二进制=%08b]\n", a, a)
	fmt.Printf("[b=%d 二进制=%08b]\n", b, b)

	c = a&b
	fmt.Printf("[与操作][%d=%d&%d] %08b=%08b&%08b \n", c,a,b,c,a, b)
	c = a|b
	fmt.Printf("[或操作][%d=%d|%d] %08b=%08b|%08b \n", c,a,b,c,a, b)
	c = a^b
	fmt.Printf("[异或操作][%d=%d^%d] %08b=%08b^%08b \n", c,a,b,c,a, b)
	c = a<<b
	fmt.Printf("[左移放大操作][%d=%d<<%d] %08b=%08b<<%08b \n", c,a,b,c,a, b)
	c = a>>b
	fmt.Printf("[右移缩小操作][%d=%d>>%d] %08b=%08b>>%08b \n", c,a,b,c,a, b)

	/**
	  [a=60 二进制=00111100]
	  [b=13 二进制=00001101]
	  [与操作][12=60&13] 00001100=00111100&00001101
	  [或操作][61=60|13] 00111101=00111100|00001101
	  [异或操作][49=60^13] 00110001=00111100^00001101
	  [左移放大操作][491520=60<<13] 1111000000000000000=00111100<<00001101
	  [右移缩小操作][0=60>>13] 00000000=00111100>>00001101
	  **/
}